tap "homebrew/services"
tap "leoafarias/fvm"
tap "xwmx/taps"
brew "bash"
brew "bat"
brew "clamav"
brew "codex"
brew "coreutils"
brew "dprint"
brew "fd"
brew "ffmpeg"
brew "fzf"
brew "gh"
brew "ghostscript"
brew "ghq"
brew "git"
brew "handbrake"
brew "htop"
brew "icu4c@76"
brew "imagemagick"
brew "sqlite"
brew "iproute2mac"
brew "jq"
brew "lazygit"
brew "luarocks"
brew "mise"
brew "pandoc"
brew "nb"
brew "neovim"
brew "nkf"
brew "ollama"
brew "poppler"
brew "pstree"
brew "qpdf"
brew "rustup"
brew "shellcheck"
brew "shfmt"
brew "starship"
brew "tcpdump"
brew "tmux"
brew "tmuxinator"
brew "tree"
brew "tree-sitter"
brew "tree-sitter-cli"
brew "ttyd"
brew "uv"
brew "zoxide"
brew "leoafarias/fvm/fvm"
cask "brave-browser"
cask "chatgpt"
cask "claude-code"
cask "cmux"
cask "copilot-cli"
cask "db-browser-for-sqlite"
cask "ghostty"
cask "jetbrains-toolbox"
cask "karabiner-elements"
cask "obsidian"
cask "rancher"
cask "vagrant"
cask "virtualbox"
cask "wezterm"
cask "zoom"
vscode "1yib.rust-bundle"
vscode "alefragnani.bookmarks"
vscode "alexisvt.flutter-snippets"
vscode "anthropic.claude-code"
vscode "astral-sh.ty"
vscode "bradlc.vscode-tailwindcss"
vscode "charliermarsh.ruff"
vscode "dart-code.dart-code"
vscode "dart-code.flutter"
vscode "dbaeumer.vscode-eslint"
vscode "dsznajder.es7-react-js-snippets"
vscode "dustypomerleau.rust-syntax"
vscode "eamodio.gitlens"
vscode "esbenp.prettier-vscode"
vscode "formulahendry.auto-rename-tag"
vscode "fwcd.kotlin"
vscode "github.copilot-chat"
vscode "github.vscode-github-actions"
vscode "glenn2223.live-sass"
vscode "hbenl.vscode-test-explorer"
vscode "hediet.vscode-drawio"
vscode "janisdd.vscode-edit-csv"
vscode "kevinrose.vsc-python-indent"
vscode "littlefoxteam.vscode-python-test-adapter"
vscode "mechatroner.rainbow-csv"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-vscode.test-adapter-converter"
vscode "nopeslide.vscode-drawio-plugin-mermaid"
vscode "oderwat.indent-rainbow"
vscode "oracle.oracle-java"
vscode "pkief.material-icon-theme"
vscode "rangav.vscode-thunder-client"
vscode "redhat.java"
vscode "ritwickdey.liveserver"
vscode "rust-lang.rust-analyzer"
vscode "serayuzgur.crates"
vscode "shd101wyy.markdown-preview-enhanced"
vscode "tamasfe.even-better-toml"
vscode "vscjava.vscode-gradle"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-maven"
vscode "vscjava.vscode-spring-initializr"
vscode "vscodevim.vim"
vscode "withfig.fig"
vscode "yzhang.markdown-all-in-one"
